---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
SpatialElementBoundarySubface Properties
SpatialElementBoundarySubface Class See Also Send Feedback
---

The SpatialElementBoundarySubface type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | SpatialBoundaryElement | Element that gave rise to this room face. |
|  | SubfaceArisesFromElementFace | Indicates if the subface is coincident with a portion of a (possibly offset) face of the element. |
|  | SubfaceType | Type of the subface. |
|  | Valid | Indicates if the subface instance is valid and can be used. |

# See Also

SpatialElementBoundarySubface Class

Autodesk.Revit.DB Namespace